{
  "format": "tfjs_graph_model",
  "generatedBy": "onnx-1.19",
  "convertedBy": "custom-extractor",
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "conv0_weight",
          "shape": [
            3,
            3,
            3,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 0,
          "length": 6912
        },
        {
          "name": "conv0_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 6912,
          "length": 256
        },
        {
          "name": "prelu0_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 7168,
          "length": 256
        },
        {
          "name": "conv1_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 7424,
          "length": 147456
        },
        {
          "name": "conv1_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 154880,
          "length": 256
        },
        {
          "name": "prelu1_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 155136,
          "length": 256
        },
        {
          "name": "conv2_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 155392,
          "length": 147456
        },
        {
          "name": "conv2_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 302848,
          "length": 256
        },
        {
          "name": "prelu2_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 303104,
          "length": 256
        },
        {
          "name": "conv3_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 303360,
          "length": 147456
        },
        {
          "name": "conv3_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 450816,
          "length": 256
        },
        {
          "name": "prelu3_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 451072,
          "length": 256
        },
        {
          "name": "conv4_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 451328,
          "length": 147456
        },
        {
          "name": "conv4_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 598784,
          "length": 256
        },
        {
          "name": "prelu4_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 599040,
          "length": 256
        },
        {
          "name": "conv5_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 599296,
          "length": 147456
        },
        {
          "name": "conv5_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 746752,
          "length": 256
        },
        {
          "name": "prelu5_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 747008,
          "length": 256
        },
        {
          "name": "conv6_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 747264,
          "length": 147456
        },
        {
          "name": "conv6_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 894720,
          "length": 256
        },
        {
          "name": "prelu6_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 894976,
          "length": 256
        },
        {
          "name": "conv7_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 895232,
          "length": 147456
        },
        {
          "name": "conv7_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1042688,
          "length": 256
        },
        {
          "name": "prelu7_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1042944,
          "length": 256
        },
        {
          "name": "conv8_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1043200,
          "length": 147456
        },
        {
          "name": "conv8_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1190656,
          "length": 256
        },
        {
          "name": "prelu8_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1190912,
          "length": 256
        },
        {
          "name": "conv9_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1191168,
          "length": 147456
        },
        {
          "name": "conv9_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1338624,
          "length": 256
        },
        {
          "name": "prelu9_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1338880,
          "length": 256
        },
        {
          "name": "conv10_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1339136,
          "length": 147456
        },
        {
          "name": "conv10_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1486592,
          "length": 256
        },
        {
          "name": "prelu10_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1486848,
          "length": 256
        },
        {
          "name": "conv11_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1487104,
          "length": 147456
        },
        {
          "name": "conv11_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1634560,
          "length": 256
        },
        {
          "name": "prelu11_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1634816,
          "length": 256
        },
        {
          "name": "conv12_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1635072,
          "length": 147456
        },
        {
          "name": "conv12_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1782528,
          "length": 256
        },
        {
          "name": "prelu12_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1782784,
          "length": 256
        },
        {
          "name": "conv13_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1783040,
          "length": 147456
        },
        {
          "name": "conv13_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1930496,
          "length": 256
        },
        {
          "name": "prelu13_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1930752,
          "length": 256
        },
        {
          "name": "conv14_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 1931008,
          "length": 147456
        },
        {
          "name": "conv14_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 2078464,
          "length": 256
        },
        {
          "name": "prelu14_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 2078720,
          "length": 256
        },
        {
          "name": "conv15_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 2078976,
          "length": 147456
        },
        {
          "name": "conv15_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 2226432,
          "length": 256
        },
        {
          "name": "prelu15_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 2226688,
          "length": 256
        },
        {
          "name": "conv16_weight",
          "shape": [
            3,
            3,
            64,
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 2226944,
          "length": 147456
        },
        {
          "name": "conv16_bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 2374400,
          "length": 256
        },
        {
          "name": "prelu16_slope",
          "shape": [
            64
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 2374656,
          "length": 256
        },
        {
          "name": "conv_final_weight",
          "shape": [
            3,
            3,
            64,
            12
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 2374912,
          "length": 27648
        },
        {
          "name": "conv_final_bias",
          "shape": [
            12
          ],
          "dtype": "float32",
          "path": "weights.bin",
          "offset": 2402560,
          "length": 48
        }
      ]
    }
  ],
  "modelTopology": {
    "node": [
      {
        "name": "input_placeholder",
        "op": "Placeholder",
        "inputs": [],
        "outputs": [
          "input_placeholder"
        ],
        "attr": {
          "dtype": {
            "type": 1
          },
          "shape": {
            "dim": [
              {
                "size": "1"
              },
              {
                "size": "3"
              },
              {
                "size": "-1"
              },
              {
                "size": "-1"
              }
            ]
          }
        }
      },
      {
        "name": "conv0_conv2d",
        "op": "Conv2D",
        "inputs": [
          "input_placeholder",
          "conv0_weight"
        ],
        "outputs": [
          "conv0_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv0_add",
        "op": "Add",
        "inputs": [
          "conv0_conv2d_out",
          "conv0_bias"
        ],
        "outputs": [
          "conv0_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu0",
        "op": "Prelu",
        "inputs": [
          "conv0_out",
          "prelu0_slope"
        ],
        "outputs": [
          "prelu0_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv1_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu0_out",
          "conv1_weight"
        ],
        "outputs": [
          "conv1_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv1_add",
        "op": "Add",
        "inputs": [
          "conv1_conv2d_out",
          "conv1_bias"
        ],
        "outputs": [
          "conv1_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu1",
        "op": "Prelu",
        "inputs": [
          "conv1_out",
          "prelu1_slope"
        ],
        "outputs": [
          "prelu1_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv2_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu1_out",
          "conv2_weight"
        ],
        "outputs": [
          "conv2_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv2_add",
        "op": "Add",
        "inputs": [
          "conv2_conv2d_out",
          "conv2_bias"
        ],
        "outputs": [
          "conv2_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu2",
        "op": "Prelu",
        "inputs": [
          "conv2_out",
          "prelu2_slope"
        ],
        "outputs": [
          "prelu2_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv3_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu2_out",
          "conv3_weight"
        ],
        "outputs": [
          "conv3_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv3_add",
        "op": "Add",
        "inputs": [
          "conv3_conv2d_out",
          "conv3_bias"
        ],
        "outputs": [
          "conv3_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu3",
        "op": "Prelu",
        "inputs": [
          "conv3_out",
          "prelu3_slope"
        ],
        "outputs": [
          "prelu3_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv4_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu3_out",
          "conv4_weight"
        ],
        "outputs": [
          "conv4_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv4_add",
        "op": "Add",
        "inputs": [
          "conv4_conv2d_out",
          "conv4_bias"
        ],
        "outputs": [
          "conv4_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu4",
        "op": "Prelu",
        "inputs": [
          "conv4_out",
          "prelu4_slope"
        ],
        "outputs": [
          "prelu4_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv5_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu4_out",
          "conv5_weight"
        ],
        "outputs": [
          "conv5_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv5_add",
        "op": "Add",
        "inputs": [
          "conv5_conv2d_out",
          "conv5_bias"
        ],
        "outputs": [
          "conv5_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu5",
        "op": "Prelu",
        "inputs": [
          "conv5_out",
          "prelu5_slope"
        ],
        "outputs": [
          "prelu5_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv6_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu5_out",
          "conv6_weight"
        ],
        "outputs": [
          "conv6_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv6_add",
        "op": "Add",
        "inputs": [
          "conv6_conv2d_out",
          "conv6_bias"
        ],
        "outputs": [
          "conv6_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu6",
        "op": "Prelu",
        "inputs": [
          "conv6_out",
          "prelu6_slope"
        ],
        "outputs": [
          "prelu6_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv7_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu6_out",
          "conv7_weight"
        ],
        "outputs": [
          "conv7_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv7_add",
        "op": "Add",
        "inputs": [
          "conv7_conv2d_out",
          "conv7_bias"
        ],
        "outputs": [
          "conv7_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu7",
        "op": "Prelu",
        "inputs": [
          "conv7_out",
          "prelu7_slope"
        ],
        "outputs": [
          "prelu7_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv8_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu7_out",
          "conv8_weight"
        ],
        "outputs": [
          "conv8_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv8_add",
        "op": "Add",
        "inputs": [
          "conv8_conv2d_out",
          "conv8_bias"
        ],
        "outputs": [
          "conv8_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu8",
        "op": "Prelu",
        "inputs": [
          "conv8_out",
          "prelu8_slope"
        ],
        "outputs": [
          "prelu8_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv9_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu8_out",
          "conv9_weight"
        ],
        "outputs": [
          "conv9_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv9_add",
        "op": "Add",
        "inputs": [
          "conv9_conv2d_out",
          "conv9_bias"
        ],
        "outputs": [
          "conv9_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu9",
        "op": "Prelu",
        "inputs": [
          "conv9_out",
          "prelu9_slope"
        ],
        "outputs": [
          "prelu9_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv10_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu9_out",
          "conv10_weight"
        ],
        "outputs": [
          "conv10_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv10_add",
        "op": "Add",
        "inputs": [
          "conv10_conv2d_out",
          "conv10_bias"
        ],
        "outputs": [
          "conv10_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu10",
        "op": "Prelu",
        "inputs": [
          "conv10_out",
          "prelu10_slope"
        ],
        "outputs": [
          "prelu10_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv11_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu10_out",
          "conv11_weight"
        ],
        "outputs": [
          "conv11_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv11_add",
        "op": "Add",
        "inputs": [
          "conv11_conv2d_out",
          "conv11_bias"
        ],
        "outputs": [
          "conv11_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu11",
        "op": "Prelu",
        "inputs": [
          "conv11_out",
          "prelu11_slope"
        ],
        "outputs": [
          "prelu11_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv12_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu11_out",
          "conv12_weight"
        ],
        "outputs": [
          "conv12_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv12_add",
        "op": "Add",
        "inputs": [
          "conv12_conv2d_out",
          "conv12_bias"
        ],
        "outputs": [
          "conv12_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu12",
        "op": "Prelu",
        "inputs": [
          "conv12_out",
          "prelu12_slope"
        ],
        "outputs": [
          "prelu12_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv13_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu12_out",
          "conv13_weight"
        ],
        "outputs": [
          "conv13_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv13_add",
        "op": "Add",
        "inputs": [
          "conv13_conv2d_out",
          "conv13_bias"
        ],
        "outputs": [
          "conv13_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu13",
        "op": "Prelu",
        "inputs": [
          "conv13_out",
          "prelu13_slope"
        ],
        "outputs": [
          "prelu13_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv14_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu13_out",
          "conv14_weight"
        ],
        "outputs": [
          "conv14_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv14_add",
        "op": "Add",
        "inputs": [
          "conv14_conv2d_out",
          "conv14_bias"
        ],
        "outputs": [
          "conv14_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu14",
        "op": "Prelu",
        "inputs": [
          "conv14_out",
          "prelu14_slope"
        ],
        "outputs": [
          "prelu14_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv15_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu14_out",
          "conv15_weight"
        ],
        "outputs": [
          "conv15_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv15_add",
        "op": "Add",
        "inputs": [
          "conv15_conv2d_out",
          "conv15_bias"
        ],
        "outputs": [
          "conv15_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu15",
        "op": "Prelu",
        "inputs": [
          "conv15_out",
          "prelu15_slope"
        ],
        "outputs": [
          "prelu15_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv16_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu15_out",
          "conv16_weight"
        ],
        "outputs": [
          "conv16_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv16_add",
        "op": "Add",
        "inputs": [
          "conv16_conv2d_out",
          "conv16_bias"
        ],
        "outputs": [
          "conv16_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "prelu16",
        "op": "Prelu",
        "inputs": [
          "conv16_out",
          "prelu16_slope"
        ],
        "outputs": [
          "prelu16_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "conv_final_conv2d",
        "op": "Conv2D",
        "inputs": [
          "prelu16_out",
          "conv_final_weight"
        ],
        "outputs": [
          "conv_final_conv2d_out"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "strides": {
            "list": [
              1,
              1,
              1,
              1
            ]
          },
          "padding": {
            "s": "SAME"
          },
          "data_format": {
            "s": "NCHW"
          },
          "dilations": {
            "list": [
              1,
              1,
              1,
              1
            ]
          }
        }
      },
      {
        "name": "conv_final_add",
        "op": "Add",
        "inputs": [
          "conv_final_conv2d_out",
          "conv_final_bias"
        ],
        "outputs": [
          "conv_final_out"
        ],
        "attr": {
          "T": {
            "type": 1
          }
        }
      },
      {
        "name": "pixelshuffle",
        "op": "DepthToSpace",
        "inputs": [
          "conv_final_out"
        ],
        "outputs": [
          "output"
        ],
        "attr": {
          "T": {
            "type": 1
          },
          "block_size": {
            "i": 2
          },
          "data_format": {
            "s": "NCHW"
          }
        }
      }
    ],
    "inputs": [
      {
        "name": "input_placeholder",
        "shape": [
          1,
          3,
          -1,
          -1
        ]
      }
    ],
    "outputs": [
      {
        "name": "output"
      }
    ],
    "versions": {
      "producer": "1.0",
      "minConsumer": "1.0"
    }
  }
}