7767517
72 73
Input                    data                  0 1 data
Split                    splitncnn_input0         1 2 data input.1_splitncnn_0 input.1_splitncnn_1
Convolution              /body.0/Conv             1 1 input.1_splitncnn_1 /body.0/Conv_output_0 0=64 1=3 4=1 5=1 6=1728
PReLU                    /body.1/PRelu            1 1 /body.0/Conv_output_0 /body.1/PRelu_output_0 0=64
Convolution              /body.2/Conv             1 1 /body.1/PRelu_output_0 /body.2/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.3/PRelu            1 1 /body.2/Conv_output_0 /body.3/PRelu_output_0 0=64
Convolution              /body.4/Conv             1 1 /body.3/PRelu_output_0 /body.4/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.5/PRelu            1 1 /body.4/Conv_output_0 /body.5/PRelu_output_0 0=64
Convolution              /body.6/Conv             1 1 /body.5/PRelu_output_0 /body.6/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.7/PRelu            1 1 /body.6/Conv_output_0 /body.7/PRelu_output_0 0=64
Convolution              /body.8/Conv             1 1 /body.7/PRelu_output_0 /body.8/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.9/PRelu            1 1 /body.8/Conv_output_0 /body.9/PRelu_output_0 0=64
Convolution              /body.10/Conv            1 1 /body.9/PRelu_output_0 /body.10/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.11/PRelu           1 1 /body.10/Conv_output_0 /body.11/PRelu_output_0 0=64
Convolution              /body.12/Conv            1 1 /body.11/PRelu_output_0 /body.12/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.13/PRelu           1 1 /body.12/Conv_output_0 /body.13/PRelu_output_0 0=64
Convolution              /body.14/Conv            1 1 /body.13/PRelu_output_0 /body.14/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.15/PRelu           1 1 /body.14/Conv_output_0 /body.15/PRelu_output_0 0=64
Convolution              /body.16/Conv            1 1 /body.15/PRelu_output_0 /body.16/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.17/PRelu           1 1 /body.16/Conv_output_0 /body.17/PRelu_output_0 0=64
Convolution              /body.18/Conv            1 1 /body.17/PRelu_output_0 /body.18/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.19/PRelu           1 1 /body.18/Conv_output_0 /body.19/PRelu_output_0 0=64
Convolution              /body.20/Conv            1 1 /body.19/PRelu_output_0 /body.20/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.21/PRelu           1 1 /body.20/Conv_output_0 /body.21/PRelu_output_0 0=64
Convolution              /body.22/Conv            1 1 /body.21/PRelu_output_0 /body.22/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.23/PRelu           1 1 /body.22/Conv_output_0 /body.23/PRelu_output_0 0=64
Convolution              /body.24/Conv            1 1 /body.23/PRelu_output_0 /body.24/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.25/PRelu           1 1 /body.24/Conv_output_0 /body.25/PRelu_output_0 0=64
Convolution              /body.26/Conv            1 1 /body.25/PRelu_output_0 /body.26/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.27/PRelu           1 1 /body.26/Conv_output_0 /body.27/PRelu_output_0 0=64
Convolution              /body.28/Conv            1 1 /body.27/PRelu_output_0 /body.28/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.29/PRelu           1 1 /body.28/Conv_output_0 /body.29/PRelu_output_0 0=64
Convolution              /body.30/Conv            1 1 /body.29/PRelu_output_0 /body.30/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.31/PRelu           1 1 /body.30/Conv_output_0 /body.31/PRelu_output_0 0=64
Convolution              /body.32/Conv            1 1 /body.31/PRelu_output_0 /body.32/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.33/PRelu           1 1 /body.32/Conv_output_0 /body.33/PRelu_output_0 0=64
Convolution              /body.34/Conv            1 1 /body.33/PRelu_output_0 /body.34/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.35/PRelu           1 1 /body.34/Conv_output_0 /body.35/PRelu_output_0 0=64
Convolution              /body.36/Conv            1 1 /body.35/PRelu_output_0 /body.36/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.37/PRelu           1 1 /body.36/Conv_output_0 /body.37/PRelu_output_0 0=64
Convolution              /body.38/Conv            1 1 /body.37/PRelu_output_0 /body.38/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.39/PRelu           1 1 /body.38/Conv_output_0 /body.39/PRelu_output_0 0=64
Convolution              /body.40/Conv            1 1 /body.39/PRelu_output_0 /body.40/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.41/PRelu           1 1 /body.40/Conv_output_0 /body.41/PRelu_output_0 0=64
Convolution              /body.42/Conv            1 1 /body.41/PRelu_output_0 /body.42/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.43/PRelu           1 1 /body.42/Conv_output_0 /body.43/PRelu_output_0 0=64
Convolution              /body.44/Conv            1 1 /body.43/PRelu_output_0 /body.44/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.45/PRelu           1 1 /body.44/Conv_output_0 /body.45/PRelu_output_0 0=64
Convolution              /body.46/Conv            1 1 /body.45/PRelu_output_0 /body.46/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.47/PRelu           1 1 /body.46/Conv_output_0 /body.47/PRelu_output_0 0=64
Convolution              /body.48/Conv            1 1 /body.47/PRelu_output_0 /body.48/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.49/PRelu           1 1 /body.48/Conv_output_0 /body.49/PRelu_output_0 0=64
Convolution              /body.50/Conv            1 1 /body.49/PRelu_output_0 /body.50/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.51/PRelu           1 1 /body.50/Conv_output_0 /body.51/PRelu_output_0 0=64
Convolution              /body.52/Conv            1 1 /body.51/PRelu_output_0 /body.52/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.53/PRelu           1 1 /body.52/Conv_output_0 /body.53/PRelu_output_0 0=64
Convolution              /body.54/Conv            1 1 /body.53/PRelu_output_0 /body.54/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.55/PRelu           1 1 /body.54/Conv_output_0 /body.55/PRelu_output_0 0=64
Convolution              /body.56/Conv            1 1 /body.55/PRelu_output_0 /body.56/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.57/PRelu           1 1 /body.56/Conv_output_0 /body.57/PRelu_output_0 0=64
Convolution              /body.58/Conv            1 1 /body.57/PRelu_output_0 /body.58/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.59/PRelu           1 1 /body.58/Conv_output_0 /body.59/PRelu_output_0 0=64
Convolution              /body.60/Conv            1 1 /body.59/PRelu_output_0 /body.60/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.61/PRelu           1 1 /body.60/Conv_output_0 /body.61/PRelu_output_0 0=64
Convolution              /body.62/Conv            1 1 /body.61/PRelu_output_0 /body.62/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.63/PRelu           1 1 /body.62/Conv_output_0 /body.63/PRelu_output_0 0=64
Convolution              /body.64/Conv            1 1 /body.63/PRelu_output_0 /body.64/Conv_output_0 0=64 1=3 4=1 5=1 6=36864
PReLU                    /body.65/PRelu           1 1 /body.64/Conv_output_0 /body.65/PRelu_output_0 0=64
Convolution              /body.66/Conv            1 1 /body.65/PRelu_output_0 /body.66/Conv_output_0 0=48 1=3 4=1 5=1 6=27648
PixelShuffle             /upsampler/DepthToSpace  1 1 /body.66/Conv_output_0 /upsampler/DepthToSpace_output_0 0=4
Interp                   /Resize                  1 1 input.1_splitncnn_0 /Resize_output_0 0=1 1=4.000000e+00 2=4.000000e+00
BinaryOp                 /Add                     2 1 /upsampler/DepthToSpace_output_0 /Resize_output_0 output